## Setup del SQL y Ejemplo
Esta celda es encesaria en cada notebook ya que conecta a la extensión de Jupyter Notebook con el lenguaje SQL y permite además conectarse a el sakila del repo

In [1]:
#load_ext sql
%reload_ext sql 
%sql mysql+mysqlconnector://root:root@localhost:3306/sakila

## Prueba 1
Obteniendo la cantidad total de películas disponibles

In [2]:
%%sql
SELECT COUNT(*) AS total_films FROM film;

 * mysql+mysqlconnector://root:***@localhost:3306/sakila
1 rows affected.

[(1000,)]

# Prueba 2
Obteniendo las tablas totales que hay en Sakila y su nombre

In [13]:
%%sql
SELECT COUNT(*) AS total_tables
FROM information_schema.tables
WHERE table_schema = 'sakila';

 * mysql+mysqlconnector://root:***@localhost:3306/sakila
1 rows affected.

[(23,)]

In [9]:
%%sql
SHOW TABLES;

 * mysql+mysqlconnector://root:***@localhost:3306/sakila
23 rows affected.

[('actor',),
 ('actor_info',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('customer_list',),
 ('film',),
 ('film_actor',),
 ('film_category',),
 ('film_list',),
 ('film_text',),
 ('inventory',),
 ('language',),
 ('nicer_but_slower_film_list',),
 ('payment',),
 ('rental',),
 ('sales_by_film_category',),
 ('sales_by_store',),
 ('staff',),
 ('staff_list',),
 ('store',)]

## Prueba 3
Obteniendo los 7 primeros actores en orden albabético.

In [22]:
%%sql
SELECT * FROM actor ORDER BY last_name, first_name LIMIT 7;

 * mysql+mysqlconnector://root:***@localhost:3306/sakila
7 rows affected.

[(58, 'CHRISTIAN', 'AKROYD', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (182, 'DEBBIE', 'AKROYD', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (92, 'KIRSTEN', 'AKROYD', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (118, 'CUBA', 'ALLEN', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (145, 'KIM', 'ALLEN', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (194, 'MERYL', 'ALLEN', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (76, 'ANGELINA', 'ASTAIRE', datetime.datetime(2006, 2, 15, 4, 34, 33))]

## Prueba 4
10 peliculas que hayan sido estrenadas al año más reciente (si, 2006 es el año mas reciente de datos).

In [26]:
%%sql
SELECT * from film WHERE release_year = (SELECT MAX(release_year) FROM film) LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/sakila
10 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', {'Behind the Scenes', 'Deleted Scenes'}, datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 2006, 1, None, 3, Decimal('4.99'), 48, Decimal('12.99'), 'G', {'Trailers', 'Deleted Scenes'}, datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (3, 'ADAPTATION HOLES', 'A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory', 2006, 1, None, 7, Decimal('2.99'), 50, Decimal('18.99'), 'NC-17', {'Trailers', 'Deleted Scenes'}, datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (4, 'AFFAIR PREJUDICE', 'A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank', 2006, 1, None, 5, Decimal('2.99'), 117, Decimal('26.99'), 'G', {'Commentaries', 'Behind the Scenes'}, datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (5, 'AFRICAN EGG', 'A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico', 2006, 1, None, 6, Decimal('2.99'), 130, Decimal('22.99'), 'G', {'Deleted Scenes'}, datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (6, 'AGENT TRUMAN', 'A Intrepid Panorama of a Robot And a Boy who must Escape a Sumo Wrestler in Ancient China', 2006, 1, None, 3, Decimal('2.99'), 169, Decimal('17.99'), 'PG', {'Deleted Scenes'}, datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (7, 'AIRPLANE SIERRA', 'A Touching Saga of a Hunter And a Butler who must Discover a Butler in A Jet Boat', 2006, 1, None, 6, Decimal('4.99'), 62, Decimal('28.99'), 'PG-13', {'Trailers', 'Deleted Scenes'}, datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (8, 'AIRPORT POLLOCK', 'A Epic Tale of a Moose And a Girl who must Confront a Monkey in Ancient India', 2006, 1, None, 6, Decimal('4.99'), 54, Decimal('15.99'), 'R', {'Trailers'}, datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (9, 'ALABAMA DEVIL', 'A Thoughtful Panorama of a Database Administrator And a Mad Scientist who must Outgun a Mad Scientist in A Jet Boat', 2006, 1, None, 3, Decimal('2.99'), 114, Decimal('21.99'), 'PG-13', {'Trailers', 'Deleted Scenes'}, datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (10, 'ALADDIN CALENDAR', 'A Action-Packed Tale of a Man And a Lumberjack who must Reach a Feminist in Ancient China', 2006, 1, None, 6, Decimal('4.99'), 63, Decimal('24.99'), 'NC-17', {'Trailers', 'Deleted Scenes'}, datetime.datetime(2006, 2, 15, 5, 3, 42))]